fuyiqing/chess/EID-V2-STM32F103/EID-V2-STM32F103/Project/EID-V2-all/src/lcd.c
	xScreen = 240 - SPI_X();
  yScreen = SPI_Y();

	//如果在棋盘的方格子里面
	if((xScreen>1)&&(yScreen>1)&&(xScreen<240-1)&&(yScreen<240-1)) {
		/*if(!(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_2)) ) {
			if((xScreen < QPSIZEX/QPINTERVAL*QPINTERVAL-1)&&(yScreen <= QPSIZEY/QPINTERVAL*QPINTERVAL-1)) {
				getPos(xScreen,yScreen);
				chessFlag=(chessFlag+1)%3;
			}*/
		if((chessTable[((int)xScreen/40)*40+20][((int)yScreen/40)*40+20]==1)&&chessFlag==0)
			chessFlag=1;
		if(chessFlag==1&&(chessTable[((int)xScreen/40)*40+20][((int)yScreen/40)*40+20]==0))
			chessFlag=2;
	}
}

void EXTI2_IRQHandler (void) {
  if(EXTI_GetITStatus(EXTI_Line2) != RESET)
  {
     TouchScreen();
     EXTI_ClearITPendingBit(EXTI_Line2);
	 
  }
}


void Touch_test()
{
	TOUCH_SCREEN_INIT();
	TOUCH_INT_config();
	TOUCH_INT_EXIT_Init();
	TOUCH_InterruptConfig();
    
//	while(1);
}

//*@ param x 横坐标
//*@ param y 纵坐标
//*@ note 画一个棋子点
void LCD_DrawChessPoint(u16 x,u16 y)
{
	LCD_SetCursor(x,y);		//?????? 
	LCD_WriteRAM_Prepare();	//????GRAM
	LCD_WR_DATA(CHESS_COLOR); 
}	 

//*@ param x0 横坐标
//*@ param y0 纵坐标
//*@ param r  半径
//*@ note  画白点
void LCD_RmChessPoint(u16 x,u16 y)
{
	LCD_SetCursor(x,y);		//?????? 
	LCD_WriteRAM_Prepare();	//????GRAM
	LCD_WR_DATA(BACK_COLOR); 
}

//*@ param x0 横坐标
//*@ param y0 纵坐标
//*@ param r  半径
//*@ note  画一个棋子
void LCD_Draw_Circle_Chess(u16 x0,u16 y0,u8 r)
{
	int a,b;
	int di;
	int i;
	a=0;b=r;	  
	di=3-(r<<1);             //??????????
	for(i=0;i<=r;i++){
	a=0;b=i;	
	while(a<=b)
	{
		LCD_DrawChessPoint(x0+a,y0-b);             //5
 		LCD_DrawChessPoint(x0+b,y0-a);             //0           
		LCD_DrawChessPoint(x0+b,y0+a);             //4               
		LCD_DrawChessPoint(x0+a,y0+b);             //6 
		LCD_DrawChessPoint(x0-a,y0+b);             //1       
 		LCD_DrawChessPoint(x0-b,y0+a);             
		LCD_DrawChessPoint(x0-a,y0-b);             //2             
  		LCD_DrawChessPoint(x0-b,y0-a);             //7     	         
		a++;
		//??Bresenham????     
		if(di<0)di+=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 						    
	}
}
	chessTable[x0][y0]=1;
}


//*@ param x0 横坐标
//*@ param y0 纵坐标
//*@ param r  半径
//*@ note  画一个棋子
void LCD_Rm_Circle_Chess(u16 x0,u16 y0,u8 r)
{
	int a,b;
	int di;
	int i;
	a=0;b=r;	  
	di=3-(r<<1);             //??????????
	for(i=0;i<=r;i++){
	   a=0;b=i;	
	   while(a<=b)
	   {
		LCD_RmChessPoint(x0+a,y0-b);             //5
 		LCD_RmChessPoint(x0+b,y0-a);             //0           
		LCD_RmChessPoint(x0+b,y0+a);             //4               
		LCD_RmChessPoint(x0+a,y0+b);             //6 
		LCD_RmChessPoint(x0-a,y0+b);             //1       
 		LCD_RmChessPoint(x0-b,y0+a);             
		LCD_RmChessPoint(x0-a,y0-b);             //2             
  		LCD_RmChessPoint(x0-b,y0-a);             //7     	         
		a++;
		//??Bresenham????     
		if(di<0)di+=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 						    
	    }
     }
	chessTable[x0][y0]=0;
}

















